combustion/fireFoam/LES/flameSpreadWaterSuppressionPanel/0/pyrolysisRegion/qr
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      qr;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 0 -3 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    coupledWall_top
    {
        type            zeroGradient;
    }

    coupledWall_side
    {
        type            empty;
    }

    region0_to_pyrolysisRegion_coupledWall
    {
        type            mappedField;
        sampleRegion    region0;
        sampleMode      nearestPatchFace;
        samplePatch     region0_to_pyrolysisRegion_coupledWall;
        offset          (0 0 0);
        field       qr; // this is the name of qr field in region0
        setAverage      no;
        average         0;
        value           uniform 0;
    }
}


// ************************************************************************* //
